import * as _ from 'underscore';
import { setBaseParameters } from '../common/function';
import { IJob } from '../models';

/**
 * 職業情報リスト初期化.
 */
export function initJobs(): _.Dictionary<IJob> {
    const keys: string[] = _.map(master, values => values[0]);
    const values: IJob[] = _.map(master, (values, index): IJob => {
        const result: IJob = {
            category: '職業',
            displayName: values[0],
            kind: '職業',
            lower: values[1],
            majorCategory: '職業',
            name: values[0],
            necessaryParams: {},
            order: 200000000 + index + 1,
            seq: index + 1,
            skills: values.slice(9),
            upper: values[2],
        };
        setBaseParameters(result.necessaryParams, values.slice(3));
        return result;
    });
    return _.object(keys, values);
}

/**
 * マスタデータ.
 */
const master: any[][] = [
    ['戦士', '', '戦士マスター', '5', '5', '5', '10', '5', '5', '[才能] 防御力', '[才能] アイテム装備可能数', '[+1] アイテム装備可能数', '[+15%] 攻撃威力の増減(%)', '[1.20] 称号付与', '[1.3倍] 鎧装備', '[戦士Lv15] 鉄壁', '[戦士Lv30] 不死身', '[戦士Lv70] 完全武装'],
    ['戦士マスター', '戦士', '', '7', '7', '7', '12', '7', '7', '[戦士マスターLv15] 鉄壁', '[戦士マスターLv30] 不死身', '[戦士マスターLv70] 完全武装'],
    ['剣士', '', '剣士マスター', '10', '5', '5', '5', '5', '5', '[才能] 攻撃回数', '[+1] 攻撃回数アップ', '[+20] 必殺率アップ', '[最大60] 必殺率最大値', '[30%] 攻防戦術', '[1.4倍] 剣装備', '[剣士Lv15] 打ち合い', '[剣士Lv30] 魔法支援', '[剣士Lv70] 激闘'],
    ['剣士マスター', '剣士', '', '12', '7', '7', '7', '7', '7', '[剣士マスターLv15] 打ち合い', '[剣士マスターLv30] 魔法支援', '[剣士マスターLv70] 激闘'],
    ['盗賊', '', '盗賊マスター', '5', '5', '5', '5', '10', '5', '[2.0倍] アイテム罠解除能力', '[才能] 罠解除能力', '[戦術] 先制攻撃', '[+1] アイテム装備可能数', '[-20%] 攻撃威力の増減(%)', '[+18] 必殺率アップ', '[最大70] 必殺率最大値', '[1.4倍] 細剣装備', '[戦術] 双剣', '[+5%] 修復機能強化', '[盗賊Lv15] 幸運(レア1.2倍)', '[盗賊Lv30] 2回行動', '[盗賊Lv70] 危機回避'],
    ['盗賊マスター', '盗賊', '', '7', '7', '7', '7', '12', '7', '[盗賊マスターLv15] 幸運(レア1.3倍)', '[盗賊マスターLv30] 2回行動', '[盗賊マスターLv70] 危機回避'],
    ['僧侶', '', '僧侶マスター', '5', '5', '10', '5', '5', '5', '[Lv7] 僧侶魔法', '[2.0倍] アイテム魔法回復量', '[才能] 最大HP', '[才能] 魔法防御力', '[1.6倍] 不死に特効', '[9%] 全体回復Lv3', '[1.10] 称号付与', '[1.4倍] 魔道書装備', '[1/2] 石化抵抗', '[僧侶Lv15] 保護', '[僧侶Lv30] 祝福', '[僧侶Lv70] 救出'],
    ['僧侶マスター', '僧侶', '', '7', '7', '12', '7', '7', '7', '[僧侶マスターLv15] 保護', '[僧侶マスターLv30] 祝福', '[僧侶マスターLv70] 救出'],
    ['魔法使い', '', '魔法使いマスター', '5', '10', '5', '5', '5', '5', '[Lv7] 魔法使い魔法', '[2.0倍] アイテム魔法攻撃力', '[20%] 魔法攻撃力→攻撃力', '[10%] 魔法攻撃力→命中精度', '[+20%] 魔法威力の増減(%)', '[1.3倍] ワンド装備', '[2/3] 魔法に強い', '[魔法使いLv15] 魔力増幅(%)', '[魔法使いLv30] 魔力吸収', '[魔法使いLv70] 破壊魔法'],
    ['魔法使いマスター', '魔法使い', '', '7', '12', '7', '7', '7', '7', '[魔法使いマスターLv15] 魔力増幅(%)', '[魔法使いマスターLv30] 魔力吸収', '[魔法使いマスターLv70] 破壊魔法'],
    ['狩人', '', '狩人マスター', '10', '8', '9', '10', '12', '10', '[才能] 命中精度', '[最大50] 必殺率最大値', '[+2] アイテム装備可能数', '[+15] 追加ダメージ', '[1.4倍] 弓装備', '[1/2] 反撃回避', '[狩人Lv15] 追撃', '[狩人Lv30] 精神集中', '[狩人Lv70] 見破り'],
    ['狩人マスター', '狩人', '', '12', '10', '11', '12', '14', '12', '[狩人マスターLv15] 追撃', '[狩人マスターLv30] 精神集中', '[狩人マスターLv70] 見破り'],
    ['修道者', '', '修道者マスター', '10', '10', '10', '10', '10', '10', '[才能] 最大HP', '[2/3] 攻撃に強い', '[+25%] アイテム獲得+', '[+2] アイテム装備可能数', '[+80%] 獲得経験値+', '[1.4倍] 法衣装備', '[1.4倍] その他装備', '[無効] 反撃無効', '[修道者Lv15] 不殺', '[修道者Lv30] 人徳(経験1.3倍)', '[修道者Lv70] 修行(経験1.7倍)'],
    ['修道者マスター', '修道者', '', '12', '12', '12', '12', '12', '12', '[修道者マスターLv15] 不殺', '[修道者マスターLv30] 人徳(経験1.4倍)', '[修道者マスターLv70] 修行(経験1.8倍)'],
    ['侍', '', '侍マスター', '13', '6', '7', '11', '11', '8', '[2.0倍] アイテム攻撃力', '[半減] 攻撃回数', '[-2] 攻撃回数ダウン', '[1.4倍] 刀装備', '[0.66] 獲得経験値', '[侍Lv15] 一撃必殺', '[侍Lv30] 不屈', '[侍Lv70] 剣豪'],
    ['侍マスター', '侍', '', '15', '8', '9', '13', '13', '10', '[侍マスターLv15] 一撃必殺', '[侍マスターLv30] 不屈', '[侍マスターLv70] 剣豪'],
    ['剣聖', '', '剣聖マスター', '11', '7', '7', '10', '13', '11', '[2.0倍] アイテム命中精度', '[才能] 回避能力', '[+2] 攻撃回数アップ', '[+1] アイテム装備可能数', '[0.66] 獲得経験値', '[1.4倍] 小手装備', '[剣聖Lv15] 連続攻撃(%)', '[剣聖Lv30] 心眼', '[剣聖Lv70] 見切り'],
    ['剣聖マスター', '剣聖', '', '13', '9', '9', '12', '15', '13', '[剣聖マスターLv15] 連続攻撃(%)', '[剣聖マスターLv30] 心眼', '[剣聖マスターLv70] 見切り'],
    ['秘法剣士', '', '秘法剣士マスター', '12', '12', '10', '10', '10', '13', '[Lv5] 魔法使い魔法', '[才能] 最大HP', '[才能] 魔法攻撃力', '[+1] 攻撃回数アップ', '[+1] アイテム装備可能数', '[戦術] 先制攻撃', '[25%] 魔法攻撃力→攻撃力', '[無効] 反撃無効', '[2.00] 獲得経験値', '[0.50] 獲得経験値', '[1.2倍] 剣装備', '[1.2倍] ワンド装備', '[秘法剣士Lv15] ブースト', '[秘法剣士Lv30] 剣と魔法', '[秘法剣士Lv70] 魔人'],
    ['秘法剣士マスター', '秘法剣士', '', '14', '14', '12', '12', '12', '15', '[秘法剣士マスターLv15] ブースト', '[秘法剣士マスターLv30] 剣と魔法', '[秘法剣士マスターLv70] 魔人'],
    ['賢者', '', '賢者マスター', '5', '13', '13', '8', '9', '10', '[Lv7] 魔法使い魔法', '[Lv7] 僧侶魔法', '[2.0倍] アイテム魔法防御力', '[+3] アイテム装備可能数', '[20%] 魔法回復量→魔法攻撃力', '[1.40] 称号付与', '[0.50] 獲得経験値', '[1.4倍] 盾装備', '[+2%] 修復機能強化', '[賢者Lv15] 魔道書装備', '[賢者Lv30] 連続詠唱(%)', '[賢者Lv70] 回復結界'],
    ['賢者マスター', '賢者', '', '7', '15', '15', '10', '11', '12', '[賢者マスターLv15] 魔道書装備', '[賢者マスターLv30] 連続詠唱(%)', '[賢者マスターLv70] 回復結界'],
    ['忍者', '', '忍者マスター', '13', '13', '13', '13', '13', '13', '[2.0倍] アイテム必殺率', '[2.0倍] アイテム回避能力', '[1.5倍] アイテム罠解除能力', '[+3] 攻撃回数アップ', '[+2] アイテム装備可能数', '[1.2倍] 格闘1.2倍', '[+30%] 格闘+30(%)', '[最大90] 必殺率最大値', '[0.50] 獲得経験値', '[0.66] 獲得経験値', '[忍者Lv15] 隠密(探索時間4/5)', '[忍者Lv30] 達人', '[忍者Lv70] 必殺連撃'],
    ['忍者マスター', '忍者', '', '15', '15', '15', '15', '15', '15', '[忍者マスターLv15] 隠密(探索時間3/4)', '[忍者マスターLv30] 達人', '[忍者マスターLv70] 必殺連撃'],
    ['君主', '', '君主マスター', '12', '8', '12', '13', '8', '12', '[Lv6] 僧侶魔法', '[2/3] ブレスに強い', '[才能] 攻撃力', '[2.0倍] アイテム最大HP', '[+2] アイテム装備可能数', '[15%] 魔法回復量→攻撃力', '[0.50] 獲得経験値', '[0.50] 取得GP', '[1.15] 称号付与', '[1.3倍] 重鎧装備', '[戦術] 劣化修復機能Lv3', '[君主Lv15] 守護', '[君主Lv30] 指揮', '[君主Lv70] 貫通'],
    ['君主マスター', '君主', '', '14', '10', '14', '15', '10', '14', '[君主マスターLv15] 守護', '[君主マスターLv30] 指揮', '[君主マスターLv70] 貫通'],
    ['ロイヤルライン', '', 'ロイヤルマスター', '99', '99', '99', '99', '99', '99', '[+100%] 獲得経験値+', '[+100%] 取得GP+', '[才能] 最大HP', '[才能] 攻撃力', '[才能] 命中精度', '[才能] 必殺率', '[才能] 回避能力', '[才能] 魔法攻撃力', '[才能] 魔法回復量', '[才能] 防御力', '[才能] 魔法防御力', '[+1] アイテム装備可能数', '[1.4倍] ロッド装備', '[1.4倍] 宝石装備', '[戦術] 近距離攻撃適正', '[戦術] 遠距離攻撃適正', '[1/3] 石化耐性', '[ロイヤルラインLv15] 賠償', '[ロイヤルラインLv30] 栄華(GP1.3倍)', '[ロイヤルラインLv70] 搾取(GP1.8倍)'],
    ['ロイヤルマスター', 'ロイヤルライン', '', '99', '99', '99', '99', '99', '99', '[ロイヤルマスターLv15] 賠償', '[ロイヤルマスターLv30] 栄華(GP1.4倍)', '[ロイヤルマスターLv70] 搾取(GP2.0倍)'],
];

