import * as _ from 'underscore';
import { setBaseParameters } from '../common/function';
import { ISpecies } from '../models';

/**
 * 種族情報リスト初期化.
 */
export function initSpecies(): _.Dictionary<ISpecies> {
    const keys: string[] = _.map(master, values => values[0]);
    const values: ISpecies[] = _.map(master, (values, index): ISpecies => {
        const result: ISpecies = {
            category: '種族',
            displayName: values[1],
            kind: '種族',
            majorCategory: '種族',
            maxLevel: values[4],
            name: values[0],
            order: 100000000 + index + 1,
            seq: index + 1,
            skills: values.slice(11),
        };
        setBaseParameters(result, values.slice(5));
        return result;
    });
    return _.object(keys, values);
}

/**
 * マスタデータ.
 */
const master: any[][] = [
    ['人間:男', '人間', '人型', '', 200, 7, 7, 8, 7, 7, 7, '[+70%] 獲得経験値+', '[+50%] 取得GP+', '[弱点] ニュークリア', '[1.3倍] 刀装備', '[人間Lv50] 学習能力(経験値1.6倍)', '[人間Lv99] 君臨', '[人間Lv150] ゾーン', '[人間Lv200] 到達者'],
    ['人間:女', '人間', '人型', '', 200, 6, 6, 7, 8, 8, 8, '[+70%] 獲得経験値+', '[+50%] 取得GP+', '[弱点] ニュークリア', '[1.3倍] 刀装備', '[人間Lv50] 学習能力(経験値1.6倍)', '[人間Lv99] 君臨', '[人間Lv150] ゾーン', '[人間Lv200] 到達者'],
    ['ピグミーチャム', 'ピグミーチャム', '人型', '', 135, 7, 9, 7, 6, 12, 15, '[個性] ギャンブル好き', '[個性+] 交渉上手', '[才能] 回避能力', '[才能] 罠解除能力', '[+3] 攻撃回数アップ', '[+1] アイテム装備可能数', '[+13] 追加ダメージ', '[+20%] アイテム獲得+', '[弱点] ブリザード', '[1.3倍] 細剣装備', '[1/2] 反撃回避', '[小人Lv50] 隠れ身(%)', '[小人Lv99] 応援'],
    ['ノーム', 'ノーム', '人型', '', 140, 8, 10, 12, 9, 5, 9, '[個性+] 正直者', '[才能] 命中精度', '[才能] 魔法攻撃力', '[才能] 魔法回復量', '[1.6倍] 不死に特効', '[1.6倍] 魔物に特効', '[Lv3] 僧侶魔法', '[3回] ヒール', '[1.3倍] ワンド装備', '[1.3倍] ロッド装備', '[1.30] 称号付与', '[戦術] 信仰', '[信者Lv50] 集中詠唱(%)', '[信者Lv99] 祈り'],
    ['ドワーフ', 'ドワーフ', '人型', '', 140, 12, 6, 8, 12, 6, 9, '[個性] 武具に興味がある', '[才能] 最大HP', '[才能] 攻撃力', '[才能] 防御力', '[戦術] 近距離攻撃適正', '[+1] アイテム装備可能数', '[2/3] 攻撃に強い', '[+40%] 取得GP+', '[1.4倍] 重鎧装備', '[戦術] 劣化修復機能Lv5', '[地族Lv50] 反骨精神', '[地族Lv99] 体当たり'],
    ['ダークエルフ', 'ダークエルフ', '人型', '', 150, 9, 12, 5, 8, 10, 7, '[個性] 好戦的', '[才能] 攻撃力', '[+2] 攻撃回数アップ', '[1/2] 眠り抵抗', '[+25%] 攻撃威力の増減(%)', '[1.2倍] 魔法威力', '[10%] 魔法攻撃力→攻撃力', '[戦術] 毒の刃', '[仲間] 森の民', '[1/2] 混乱耐性', '[黒精Lv50] 殺意', '[黒精Lv99] 群れ追う者'],
    ['吸血鬼', '吸血鬼', '不死', '', 130, 12, 10, 6, 11, 9, 10, '[個性+] 容姿端麗', '[12%] 吸収能力Lv3', '[10%] 回復能力Lv2', '[+1] アイテム装備可能数', '[1.6倍] 人型に特効', '[+15] 追加ダメージ', '[Lv3] 魔法使い魔法', '[無能] 最大HP', '[成長1.5倍] 先天資質', '[吸血] 吸血衝動', '[戦術] 吸精', '[20%] 魔法攻撃力→命中精度', '[2/3] 攻撃に強い', '[2/3] 魔法に強い', '[弱点] ブレスに弱い', '[3回] マジックアロー', '[0.66] 獲得経験値', '[1.3倍] 法衣装備', '[魔族Lv50] 魔法反撃', '[魔族Lv99] 覚醒'],
    ['エルフ', 'エルフ', '人型', '', 150, 6, 10, 13, 7, 11, 12, '[個性+] 自然が好き', '[個性+] 博愛主義', '[才能] 命中精度', '[+2] 攻撃回数アップ', '[1/2] 眠り抵抗', '[1.6倍] 不死に特効', '[6%] 全体回復Lv2', '[20%] 魔法回復量→魔法防御力', '[3回] キュア', '[1.3倍] 弓装備', '[仲間] 森の民', '[1/2] 混乱耐性', '[妖精Lv50] 反射回復', '[妖精Lv99] 即時キュア'],
    ['サイキック', 'サイキック', '人型', '', 140, 5, 15, 10, 6, 7, 8, '[個性+] 魔術に詳しい', '[Lv3] 魔法使い魔法', '[才能] 魔法防御力', '[1.6倍] 人型に特効', '[10%] 回復能力Lv2', '[20%] 魔法回復量→攻撃力', '[20%] 魔法攻撃力→HP', '[3回] ニュークリア', '[1.15倍] ワンド装備', '[1.3倍] 宝石装備', '[1.4倍] 法衣装備', '[戦術] ディープトランス', '[戦術] 魔法威力増幅T10', '[術者Lv50] 魔力分解', '[術者Lv99] 必殺魔法'],
    ['ワーキャット', 'ワーキャット', '人型', '', 135, 9, 6, 6, 9, 11, 11, '[個性] 好奇心が強い', '[個性] 誘惑に弱い', '[戦術] 先制攻撃', '[追加] 眠り攻撃', '[才能] 最大HP', '[才能] 回避能力', '[+3] 攻撃回数アップ', '[最大70] 必殺率最大値', '[1.2倍] 必殺威力', '[1.6倍] 魔物に特効', '[2倍] 眠りに弱い', '[1/2] 石化抵抗', '[獣族Lv50] 弱者狙い', '[獣族Lv99] 先手必勝'],
    ['ドラゴニュート', 'ドラゴニュート', '竜族', '', 135, 11, 7, 6, 12, 7, 9, '[個性] 自然に興味がない', '[才能] 防御力', '[才能] 魔法防御力', '[-99%] ブレスダメージ軽減(%)', '[+25] 必殺率アップ', '[最大+15] 必殺率最大値上昇', '[+1] アイテム装備可能数', '[戦術] ファイヤーブレス', '[1.1倍] ブレス強化', '[弱点] サンダーボルト', '[1.2倍] 格闘1.2倍', '[成長1.1倍] 優良種', '[1.4倍] 鎧装備', '[1.5倍] アイテム防御力', '[-25%] 混乱に強い', '[竜族Lv50] ブレス反撃', '[竜族Lv99] 先制ブレス'],
    ['アマゾネス', 'アマゾネス', '人型', '', 135, 11, 8, 7, 10, 10, 8, '[個性] 魔術を知らない', '[才能] 攻撃力', '[才能] 回避能力', '[才能] 罠解除能力', '[+16] 必殺率アップ', '[+1] 攻撃回数アップ', '[+1] アイテム装備可能数', '[+5] 追加ダメージ', '[10%] 魔法回復量→攻撃力', '[1.3倍] 剣装備', '[戦術] パリィ', '[仲間] 同性親和', '[仲間] 異性支配', '[女傑Lv50] 勇猛果敢', '[女傑Lv99] 激昂'],
    ['魔造生物', '魔造生物', '魔物', '', 99, 5, 5, 5, 5, 5, 5, '[成長1.4倍] 魔造生物', '[+40%] 格闘+40(%)', '[弱点] 魔法に弱い', '[+25%] 混乱に弱い', '[魔造Lv50] 精神感応', '[魔造Lv99] 完成体'],
    ['アンデッドマン', 'アンデッドマン', '不死', '', 140, 8, 8, 8, 16, 8, 8, '[不死] アンデッド', '[半減] 最大HP', '[20%] 回復能力Lv4', '[+2] アイテム装備可能数', '[無効] 眠り無効', '[2/3] 魔法に強い', '[1/2] クリティカル・ガード', '[抵抗] ブリザード', '[抵抗] ニュークリア', '[弱点] ファイヤーボール', '[1.3倍] 小手装備', '[1.4倍] 鎧装備', '[不死Lv50] 即時蘇生', '[不死Lv99] デスマーチ'],
    ['巨人', '巨人', '人型', '', 130, 13, 5, 9, 15, 5, 6, '[個性] 知識が乏しい', '[1.6倍] 竜族に特効', '[才能] 最大HP', '[戦術] 待機攻撃', '[+3] アイテム装備可能数', '[成長1.3倍] 超人', '[0.66] 獲得経験値', '[-25%] 混乱に強い', '[1/3] 石化耐性', '[巨人Lv50] かばう', '[巨人Lv99] タフネス'],
    ['天狗', '天狗', '魔物', '', 130, 8, 11, 8, 7, 13, 7, '[個性+] 博識', '[才能] 攻撃回数', '[2.0倍] アイテム魔法攻撃力', '[2.0倍] アイテム魔法回復量', '[3回] サンダーボルト', '[戦術] 高速行動', '[戦術] 遠距離攻撃適正', '[1/10] 反撃回避', '[弱点] マジックアロー', '[0.66] 獲得経験値', '[1.3倍] 盾装備', '[1/2] 混乱耐性', '[天妖Lv50] 飛翔', '[天妖Lv99] 疾風迅雷'],
    ['鬼', '鬼', '神魔', '', 130, 15, 6, 9, 10, 7, 8, '[個性+] 力持ち', '[個性] 食欲旺盛', '[才能] 攻撃力', '[無能] 攻撃回数', '[1/2] 貫通防御', '[+1] アイテム装備可能数', '[才能] 魔法防御力', '[1.6倍] 人型に特効', '[0.66] 獲得経験値', '[1/2] 混乱耐性', '[鬼神Lv50] 闘争心', '[鬼神Lv99] 怒り'],
    ['サイボーグ', 'サイボーグ', '人型', '', 130, 8, 7, 6, 7, 15, 10, '[無能] 最大HP', '[10%] 回復能力Lv2', '[2.0倍] 攻撃回数', '[2.0倍] アイテム防御力', '[1/10] 貫通防御', '[+1] アイテム装備可能数', '[弱点] 攻撃に弱い', '[2/3] 魔法に強い', '[2/3] ブレスに強い', '[弱点] サンダーボルト', '[0.66] 獲得経験値', '[0.66] 取得GP', '[戦術] 劣化修復機能Lv1', '[戦術] 自動劣化修復', '[機械Lv50] 加速', '[機械Lv99] シフトアップ'],
    ['ヒューマノイド:男', 'ヒューマノイド', '人型', 1, 99, 6, 7, 6, 7, 6, 4, '[才能] 回避能力', '[才能] 罠解除能力', '[+1] 攻撃回数アップ', '[+1] アイテム装備可能数', '[亜種Lv50] 突然変異(最大HP2倍)'],
    ['ヒューマノイド:女', 'ヒューマノイド', '人型', 1, 99, 4, 11, 12, 4, 8, 3, '[才能] 回避能力', '[才能] 罠解除能力', '[+1] 攻撃回数アップ', '[+1] アイテム装備可能数', '[亜種Lv50] 突然変異(魔法無効)'],
];
